Cleaning up and analyzing data on passenger survival from the Titanic. Dataset: http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic.txt

In [5]:
# Using the as keyword assigns the import to a different name, so we can reference it more easily
# In this case, instead of having to type pandas all the time, we can just type pd
import pandas as pd

# Read in the survival data
f = "titanic.csv"
titanic_survival = pd.read_csv(f)

# Print out the age column
print(titanic_survival["age"])

# We can use the isnull function to find which values in a column are missing
age_null = pd.isnull(titanic_survival["age"])
age_null
# age_null is a boolean vector, and has "True" where age is NaN, and "False" where it isn't

0       29.0000
1        2.0000
2       30.0000
3       25.0000
4        0.9167
5       47.0000
6       63.0000
7       39.0000
8       58.0000
9       71.0000
10      47.0000
11      19.0000
12          NaN
13          NaN
14          NaN
15      50.0000
16      24.0000
17      36.0000
18      37.0000
19      47.0000
20      26.0000
21      25.0000
22      25.0000
23      19.0000
24      28.0000
25      45.0000
26      39.0000
27      30.0000
28      58.0000
29          NaN
         ...
1283        NaN
1284        NaN
1285        NaN
1286        NaN
1287        NaN
1288        NaN
1289        NaN
1290        NaN
1291        NaN
1292        NaN
1293        NaN
1294        NaN
1295        NaN
1296        NaN
1297        NaN
1298        NaN
1299        NaN
1300        NaN
1301        NaN
1302        NaN
1303        NaN
1304        NaN
1305        NaN
1306        NaN
1307        NaN
1308        NaN
1309        NaN
1310        NaN
1311        NaN
1312        NaN
Name: age, dtype: float64

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12       True
13       True
14       True
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29       True
        ...
1283     True
1284     True
1285     True
1286     True
1287     True
1288     True
1289     True
1290     True
1291     True
1292     True
1293     True
1294     True
1295     True
1296     True
1297     True
1298     True
1299     True
1300     True
1301     True
1302     True
1303     True
1304     True
1305     True
1306     True
1307     True
1308     True
1309     True
1310     True
1311     True
1312     True
Name: age, dtype: bool

In [9]:
#age_null
age_null_count = len(age_null[age_null==True])
age_null_count

680

In [11]:
import pandas as pd
mean_age = sum(titanic_survival["age"]) / len(titanic_survival["age"])

# Unfortunately, mean_age is NaN.  This is because any calculations we do with a null value also result in a null value.
# This makes sense when you think about it -- how can you add a null value to a known value?
print(mean_age)

# What we have to do instead is filter the missing values out before we compute the mean.
age_null = pd.isnull(titanic_survival["age"])
good_ages = titanic_survival["age"][age_null == False]
correct_mean_age = sum(good_ages) / len(good_ages)
correct_mean_age

nan

31.19418104265403

In [16]:
titanic_survival.columns

Index([u'row.names', u'pclass', u'survived', u'name', u'age', u'embarked',
       u'home.dest', u'room', u'ticket', u'boat', u'sex'],
      dtype='object')

In [17]:
correct_mean_age = titanic_survival["age"].mean()

In [20]:
passenger_classes = [1, 2, 3]
fares_by_class = {}
fares_by_class = {}
for pclass in passenger_classes:
    pclass_rows = titanic_survival[titanic_survival["pclass"] == pclass]
#    pclass_fares = pclass_rows["fare"]
#    fare_for_class = pclass_fares.mean()
#    fares_by_class[pclass] = fare_for_class

http://pandas.pydata.org/pandas-docs/stable/generated/pandas.pivot_table.html

In [30]:
#PIVOT_TABLE- GOOD TOOL
import numpy as np

# Let's compute the survival change from 0-1 for people in each class
# The closer to one, the higher the chance people in that passenger class survived
# The "survived" column contains a 1 if the passenger survived, and a 0 if not
# The pivot_table method on a pandas dataframe will let us do this
# index specifies which column to subset data based on (in this case, we want to compute the survival percentage for each class)
# values specifies which column to subset based on the index
# The aggfunc specifies what to do with the subsets
# In this case, we split survived into 3 vectors, one for each passenger class, and take the mean of each

passenger_survival = titanic_survival.pivot_table(index="pclass", values="survived", aggfunc=np.mean)

# First class passengers had a much higher survival chance
print(passenger_survival)
passenger_age = titanic_survival.pivot_table(index="pclass", values="age", aggfunc=np.mean)
print  passenger_age

pclass
1st    0.599379
2nd    0.425000
3rd    0.192686
Name: survived, dtype: float64
pclass
1st    39.667773
2nd    28.300314
3rd    24.519658
Name: age, dtype: float64

In [31]:
import numpy as np

passenger_survival = titanic_survival.pivot_table(index="sex", values="survived", aggfunc=np.mean)

# First class passengers had a much higher survival chance
print(passenger_survival)
passenger_age = titanic_survival.pivot_table(index="sex", values="age", aggfunc=np.mean)
print (passenger_age)

sex
female    0.663067
male      0.167059
Name: survived, dtype: float64
sex
female    30.572702
male      31.581410
Name: age, dtype: float64

In [33]:
import numpy as np

# This will compute the mean survival chance and the mean age for each passenger class
passenger_survival = titanic_survival.pivot_table(index="pclass", values=["age", "survived"], aggfunc=np.mean)
print(passenger_survival)

port_stats = titanic_survival.pivot_table(index="embarked", values=["age", "survived"], aggfunc=np.mean)
print(port_stats)

              age  survived
pclass
1st     39.667773  0.599379
2nd     28.300314  0.425000
3rd     24.519658  0.192686
                   age  survived
embarked
Cherbourg    35.601504  0.586207
Queenstown   29.032258  0.311111
Southampton  29.857271  0.399651

In [38]:
import pandas as pd

# Drop all rows that have missing values
new_titanic_survival = titanic_survival.dropna()

# It looks like we have an empty dataframe now.
# This is because every row has at least one missing value.
#print(new_titanic_survival)

# We can also use the axis argument to drop columns that have missing values
new_titanic_survival = titanic_survival.dropna(axis=1)
#print(new_titanic_survival)

# We can use the subset argument to only drop rows if certain columns have missing values.
# This drops all rows where "age" or "sex" is missing.
new_titanic_survival = titanic_survival.dropna(subset=["age", "home.dest"])
print(new_titanic_survival)

     row.names pclass  survived  \
0            1    1st         1
1            2    1st         0
2            3    1st         0
3            4    1st         0
4            5    1st         1
5            6    1st         1
6            7    1st         1
7            8    1st         0
8            9    1st         1
9           10    1st         0
10          11    1st         0
11          12    1st         1
15          16    1st         1
16          17    1st         0
17          18    1st         0
18          19    1st         1
19          20    1st         1
20          21    1st         1
21          22    1st         0
22          23    1st         1
23          24    1st         1
24          25    1st         1
25          26    1st         0
26          27    1st         1
27          28    1st         1
28          29    1st         1
30          31    1st         1
31          32    1st         1
33          34    1st         0
34          35    1st         0
..         ...    ...       ...
787        788    3rd         0
788        789    3rd         0
789        790    3rd         0
793        794    3rd         0
794        795    3rd         1
806        807    3rd         0
807        808    3rd         0
808        809    3rd         0
809        810    3rd         0
810        811    3rd         0
813        814    3rd         0
817        818    3rd         1
819        820    3rd         0
821        822    3rd         1
822        823    3rd         0
823        824    3rd         0
824        825    3rd         0
825        826    3rd         0
826        827    3rd         0
827        828    3rd         0
828        829    3rd         0
829        830    3rd         0
830        831    3rd         0
831        832    3rd         0
832        833    3rd         0
833        834    3rd         0
835        836    3rd         0
836        837    3rd         0
837        838    3rd         0
838        839    3rd         0

                                                 name      age     embarked  \
0                        Allen, Miss Elisabeth Walton  29.0000  Southampton
1                         Allison, Miss Helen Loraine   2.0000  Southampton
2                 Allison, Mr Hudson Joshua Creighton  30.0000  Southampton
3     Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)  25.0000  Southampton
4                       Allison, Master Hudson Trevor   0.9167  Southampton
5                                  Anderson, Mr Harry  47.0000  Southampton
6                    Andrews, Miss Kornelia Theodosia  63.0000  Southampton
7                              Andrews, Mr Thomas, jr  39.0000  Southampton
8        Appleton, Mrs Edward Dale (Charlotte Lamson)  58.0000  Southampton
9                              Artagaveytia, Mr Ramon  71.0000    Cherbourg
10                          Astor, Colonel John Jacob  47.0000    Cherbourg
11   Astor, Mrs John Jacob (Madeleine Talmadge Force)  19.0000    Cherbourg
15     Baxter, Mrs James (Helene DeLaudeniere Chaput)  50.0000    Cherbourg
16                            Baxter, Mr Quigg Edmond  24.0000    Cherbourg
17                                Beattie, Mr Thomson  36.0000    Cherbourg
18                       Beckwith, Mr Richard Leonard  37.0000  Southampton
19    Beckwith, Mrs Richard Leonard (Sallie Monypeny)  47.0000  Southampton
20                               Behr, Mr Karl Howell  26.0000    Cherbourg
21                                 Birnbaum, Mr Jakob  25.0000    Cherbourg
22                            Bishop, Mr Dickinson H.  25.0000    Cherbourg
23            Bishop, Mrs Dickinson H. (Helen Walton)  19.0000    Cherbourg
24            Bjornstrm-Steffansson, Mr Mauritz Hakan  28.0000  Southampton
25                        Blackwell, Mr Stephen Weart  45.0000  Southampton
26                                    Blank, Mr Henry  39.0000    Cherbourg
27                             Bonnell, Miss Caroline  30.0000  Southampton
28                            Bonnell, Miss Elizabeth  58.0000  Southampton
30                            Bowen, Miss Grace Scott  45.0000    Cherbourg
31                         Bowerman, Miss Elsie Edith  22.0000  Southampton
33                             Brady, Mr John Bertram  41.0000  Southampton
34                                  Brandeis, Mr Emil  48.0000    Cherbourg
..                                                ...      ...          ...
787                     Edvardsson, Mr Gustaf Hjalmar  18.0000  Southampton
788                             Eklund, Mr Hans Linus  16.0000  Southampton
789                                 Ekstrom, Mr Johan  45.0000  Southampton
793                                 Elsbury, Mr James  47.0000  Southampton
794                      Emanuel, Miss Virginia Ethel   5.0000  Southampton
806                       Ford, Miss Doolina Margaret  21.0000  Southampton
807                            Ford, Mr Edward Watson  18.0000  Southampton
808                                 Ford, Miss Maggie   9.0000  Southampton
809                   Ford, Mrs Edward (Margaret Ann)  48.0000  Southampton
810                              Ford, Mr Neil Watson  16.0000  Southampton
813                              Gallagher, Mr Martin  25.0000   Queenstown
817                               Gilnagh, Miss Katie  16.0000   Queenstown
819                          Goldsmith, Mr Frank John  33.0000  Southampton
821              Goldsmith, Master Frank John William   9.0000  Southampton
822                              Goldsmith, Mr Nathan  41.0000  Southampton
823                    Goncalves, Mr Manuel Estanslas  38.0000  Southampton
824                             Goodwin, Mr Frederick  40.0000  Southampton
825                  Goodwin, Mrs Frederick (Augusta)  43.0000  Southampton
826                            Goodwin, Mr Charles E.  14.0000  Southampton
827                          Goodwin, Miss Lillian A.  16.0000  Southampton
828                         Goodwin, Master Harold V.   9.0000  Southampton
829                           Goodwin, Miss Jessie A.  10.0000  Southampton
830                         Goodwin, Master Sidney L.   6.0000  Southampton
831                        Goodwin, Master William F.  11.0000  Southampton
832                                  Green, Mr George  40.0000  Southampton
833                   Gronnestad, Mr Daniel Danielsen  32.0000  Southampton
835                      Gustafsson, Mr Alfred Ossian  20.0000  Southampton
836                     Gustafsson, Mr Anders Vilhelm  37.0000  Southampton
837                       Gustafsson, Mr Johan Birger  28.0000  Southampton
838                        Gustafsson, Mr Karl Gideon  19.0000  Southampton

                                     home.dest     room             ticket  \
0                                 St Louis, MO      B-5         24160 L221
1              Montreal, PQ / Chesterville, ON      C26                NaN
2              Montreal, PQ / Chesterville, ON      C26                NaN
3              Montreal, PQ / Chesterville, ON      C26                NaN
4              Montreal, PQ / Chesterville, ON      C22                NaN
5                                 New York, NY     E-12                NaN
6                                   Hudson, NY      D-7          13502 L77
7                                  Belfast, NI     A-36                NaN
8                          Bayside, Queens, NY    C-101                NaN
9                          Montevideo, Uruguay      NaN                NaN
10                                New York, NY      NaN  17754 L224 10s 6d
11                                New York, NY      NaN  17754 L224 10s 6d
15                                Montreal, PQ  B-58/60                NaN
16                                Montreal, PQ  B-58/60                NaN
17                                Winnipeg, MN      C-6                NaN
18                                New York, NY     D-35                NaN
19                                New York, NY     D-35                NaN
20                                New York, NY    C-148                NaN
21                           San Francisco, CA      NaN                NaN
22                                Dowagiac, MI     B-49                NaN
23                                Dowagiac, MI     B-49                NaN
24          Stockholm, Sweden / Washington, DC      NaN
25                                 Trenton, NJ      NaN                NaN
26                              Glen Ridge, NJ     A-31                NaN
27                              Youngstown, OH      C-7                NaN
28           Birkdale, England Cleveland, Ohio    C-103                NaN
30                             Cooperstown, NY      NaN                NaN
31            St Leonards-on-Sea, England Ohio      NaN                NaN
33                                 Pomeroy, WA      NaN                NaN
34                                   Omaha, NE      NaN   17591 L50 9s 11d
..                                         ...      ...                ...
787                   Tofta, Sweden Joliet, IL      NaN                NaN
788        Karberg, Sweden Jerome Junction, AZ      NaN                NaN
789                          Effington Rut, SD      NaN                NaN
793                              Illinois, USA      NaN                NaN
794                               New York, NY      NaN                NaN
806  Rotherfield, Sussex, England Essex Co, MA      NaN                NaN
807  Rotherfield, Sussex, England Essex Co, MA      NaN                NaN
808  Rotherfield, Sussex, England Essex Co, MA      NaN                NaN
809  Rotherfield, Sussex, England Essex Co, MA      NaN                NaN
810  Rotherfield, Sussex, England Essex Co, MA      NaN                NaN
813                               New York, NY      NaN                NaN
817          Co Longford, Ireland New York, NY      NaN                NaN
819          Strood, Kent, England Detroit, MI      NaN                NaN
821          Strood, Kent, England Detroit, MI      NaN                NaN
822                           Philadelphia, PA      NaN                NaN
823                                   Portugal      NaN                NaN
824       Wiltshire, England Niagara Falls, NY      NaN                NaN
825       Wiltshire, England Niagara Falls, NY      NaN                NaN
826       Wiltshire, England Niagara Falls, NY      NaN                NaN
827       Wiltshire, England Niagara Falls, NY      NaN                NaN
828       Wiltshire, England Niagara Falls, NY      NaN                NaN
829       Wiltshire, England Niagara Falls, NY      NaN                NaN
830       Wiltshire, England Niagara Falls, NY      NaN                NaN
831       Wiltshire, England Niagara Falls, NY      NaN                NaN
832                   Dorking, Surrey, England      NaN                NaN
833              Foresvik, Norway Portland, ND      NaN                NaN
835                      Waukegan, Chicago, IL      NaN                NaN
836        Ruotsinphytaa, Finland New York, NY      NaN                NaN
837        Ruotsinphytaa, Finland New York, NY      NaN                NaN
838                 Myren, Sweden New York, NY      NaN                NaN

      boat     sex
0        2  female
1      NaN  female
2    (135)    male
3      NaN  female
4       11    male
5        3    male
6       10  female
7      NaN    male
8        2  female
9     (22)    male
10   (124)    male
11       4  female
15       6  female
16     NaN    male
17     NaN    male
18       5    male
19       5  female
20       5    male
21   (148)    male
22       7    male
23       7  female
24       D    male
25   (241)    male
26       7    male
27       8  female
28       8  female
30       4  female
31       6  female
33     NaN    male
34   (208)    male
..     ...     ...
787    NaN    male
788    NaN    male
789    NaN    male
793    NaN    male
794     13  female
806    NaN  female
807    NaN    male
808    NaN  female
809    NaN  female
810    NaN    male
813    NaN    male
817    NaN  female
819    NaN    male
821      C    male
822    NaN    male
823    NaN    male
824    NaN    male
825    NaN  female
826    NaN    male
827    NaN  female
828    NaN    male
829    NaN  female
830    NaN    male
831    NaN    male
832    NaN    male
833    NaN    male
835    NaN    male
836    NaN    male
837    NaN    male
838    NaN    male

[600 rows x 11 columns]

In [40]:
# See the numbers to the left of each row?
# Those are row indexes.
# Since the data has so many columns, it is split into multiple lines, but there are only 5 rows.
print(titanic_survival.iloc[:5,:])


#new_titanic_survival = titanic_survival.dropna(subset=["body"])
# Now let's print out the first 5 rows in new_titanic_survival
# The row indexes here aren't the same as in titanic_survival
# This is because we modified the titanic_survival dataframe to generate new_titanic_survival
# The row indexes you see here are the rows from titanic_survival that made it through the dropna method (didn't have missing values in the "body" column)
# They retain their original numbering, though
#print(new_titanic_survival.iloc[:5,:])

# We've been using the .iloc method to address rows and columns
# .iloc works by position (row/column number)

# This code prints the fourth row in the data
print(new_titanic_survival.iloc[3,:])

# Using .loc instead addresses rows and columns by index, not position
# This actually prints the first row, because it has index 3
print(new_titanic_survival.loc[3,:])
row_index_25 = new_titanic_survival.loc[25,:]
row_position_fifth = new_titanic_survival.iloc[4,:]

   row.names pclass  survived  \
0          1    1st         1
1          2    1st         0
2          3    1st         0
3          4    1st         0
4          5    1st         1

                                              name      age     embarked  \
0                     Allen, Miss Elisabeth Walton  29.0000  Southampton
1                      Allison, Miss Helen Loraine   2.0000  Southampton
2              Allison, Mr Hudson Joshua Creighton  30.0000  Southampton
3  Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)  25.0000  Southampton
4                    Allison, Master Hudson Trevor   0.9167  Southampton

                         home.dest room      ticket   boat     sex
0                     St Louis, MO  B-5  24160 L221      2  female
1  Montreal, PQ / Chesterville, ON  C26         NaN    NaN  female
2  Montreal, PQ / Chesterville, ON  C26         NaN  (135)    male
3  Montreal, PQ / Chesterville, ON  C26         NaN    NaN  female
4  Montreal, PQ / Chesterville, ON  C22         NaN     11    male
row.names                                                  4
pclass                                                   1st
survived                                                   0
name         Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)
age                                                       25
embarked                                         Southampton
home.dest                    Montreal, PQ / Chesterville, ON
room                                                     C26
ticket                                                   NaN
boat                                                     NaN
sex                                                   female
Name: 3, dtype: object
row.names                                                  4
pclass                                                   1st
survived                                                   0
name         Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)
age                                                       25
embarked                                         Southampton
home.dest                    Montreal, PQ / Chesterville, ON
room                                                     C26
ticket                                                   NaN
boat                                                     NaN
sex                                                   female
Name: 3, dtype: object

In [44]:
#new_titanic_survival = titanic_survival.dropna(subset=["body"])

# This prints the value in the first column of the first row
#print(new_titanic_survival.iloc[0,0])

# This prints the exact same value -- it prints the value at row index 3 and column "pclass"
# This happens to also be at row 0, index 0
#print(new_titanic_survival.loc[3,"pclass"])
#row_1100_age = new_titanic_survival.loc[1100, "age"]
row_25_survived = new_titanic_survival.loc[25, "survived"]

In [45]:
new_titanic_survival = titanic_survival.dropna(subset=["age", "boat"])
titanic_reindexed = new_titanic_survival.reset_index(drop=True)

.apply()
By default, .apply() will iterate through each column in a dataframe, and perform a function on it.
The column will be passed into the function.
The result from the function will be combined with all of the other results, and placed into a new series.
The function results will have the same position as the column they were generated from.

In [46]:
import pandas as pd

# Let's look at a simple example.
# This function counts the number of null values in a series
def null_count(column):
    # Make a vector that contains True if null, False if not.
    column_null = pd.isnull(column)
    # Create a new vector with only values where the series is null.
    null = column[column_null == False]
    # Return the count of null values.
    return len(null)

# Compute null counts for each column
column_not_null_count = titanic_survival.apply(null_count)
print(column_not_null_count)

#opposite-of-documentation task

row.names    1313
pclass       1313
survived     1313
name         1313
age           633
embarked      821
home.dest     754
room           77
ticket         69
boat          347
sex          1313
dtype: int64

By passing in the axis argument, we can use the .apply() method to iterate over rows instead of columns.

In [49]:
# This function will check if a row is an entry for a minor (under 18), or not.
def age_tag(row):
    if row["age"] < 18:
        return "minor"
    elif row["age"]>=18:
        return "adult"
    else:
        return "unknown"

#modified to create all labels
# This is a boolean series with the same length as the number of rows in titanic_survival
# Each entry is True if the row at the same position is a record for a minor
# The axis of 1 specifies that it will iterate over rows, not columns

age_labels = titanic_survival.apply(age_tag, axis=1)

In [50]:
#Another pivotal table
age_group_survival = titanic_survival.pivot_table(index="age_labels", values="survived", aggfunc=np.mean)

print(age_group_survival)

KeyError: 'age_labels'